function IFS_draw(M,p)
% 迭代函数法生成分形图形的通用函数
% M是矩阵系数
% p是对应的几率
% 比如M的取值是:
% i　　 a(i)      b(i)      c(i)       d(i)     e(i)      f(i)
% 1    0.3330         0         0    0.3330         0         0
% 2    0.1670   -0.2890    0.2890    0.1670    0.3330         0
% 3    0.1670    0.2890   -0.2890    0.1670    0.5000    0.2890
% 4    0.3330         0         0    0.3330    0.6670         0
%　p的取值是：
%       0.2500    0.2500    0.2500    0.2500
N=30000; % 迭代次数
for k=1:length(p); % 生成映射矩阵a1,a2,...
    eval(['a',num2str(k),'=reshape(M(',num2str(k),',:),2,3);']);
end
xy=zeros(2,N); % 设置迭代矩阵初值
pp=meshgrid(p); % 生成网格矩阵
pp=tril(pp); % 取上三角矩阵
pp=sum(pp,2); % 对行向量求和,从而得到几率的累加结果
for k=1:N-1;
    a=rand-pp; % 计算随机数和几率向量的差值
    d=find(a<=0);% 找出满足几率条件的位置
    xy(:,k+1)=eval(['a',num2str(d(1)),'(:,1:2)'])*xy(:,k)+...
        eval(['a',num2str(d(1)),'(:,3)']); % 计算迭代点和映射矩阵的乘积
end
P=complex(xy(1,:),xy(2,:)); % 生成复数点
plot(P,'k.','markersize',2); % 画图
axis equal; % 设置坐标轴属性